src/cf/Catalogs/уатГруппыДиспетчеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатГруппыДиспетчеров</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Диспетчеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диспетчер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатГруппыДиспетчеров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Функция выполняет создание служебного обсуждения
//
// Параметры:
//  ГруппаДиспетчеров	 - СпраочникСсылка - Группа диспетчеров
// 
// Возвращаемое значение:
//   - Строка - Идентификатор обсуждения
//
Функция СоздатьСлужебноеОбсуждение(ГруппаДиспетчеров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбсуждения = ""; 
	Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		Возврат ИдентификаторОбсуждения;
	Конецесли;
	Попытка
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Заголовок    = СтрШаблон(Нстр("ru = 'Новые сообщения группы диспетчеров ""%1""'"), ГруппаДиспетчеров.Наименование);
		Обсуждение.Групповое    = Истина;
		Обсуждение.Отображаемое = Истина;
		
		КонтекстОбсуждения = Новый КонтекстОбсужденияСистемыВзаимодействия(ПолучитьНавигационнуюСсылку(ГруппаДиспетчеров));
		Обсуждение.КонтекстОбсуждения  = КонтекстОбсуждения;
		Обсуждение.Записать();
		
		ИдентификаторОбсуждения = Обсуждение.Идентификатор;	
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ИдентификаторОбсуждения;
КонецФункции

// Процедура выполняет отправку служебного сообщения
//
// Параметры:
//  ГруппаДиспетчеров	 - 	СправочникСсылка - Группа диспетчеров
//  СодержаниеСообщения	 - 	Строка - Текст сообщения
//  Автор				 - 	СправочникСсылка - Пользователь-автор сообщения
//
Процедура ОтправитьСообщениеВСлужебноеОбсуждение(ГруппаДиспетчеров, СодержаниеСообщения = "", Автор = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ГруппаДиспетчеров.ИдентификаторОбсуждения) Тогда
		СправочникОбъект = ГруппаДиспетчеров.ПолучитьОбъект();
		СправочникОбъект.ИдентификаторОбсуждения = Справочники.уатГруппыДиспетчеров.СоздатьСлужебноеОбсуждение(ГруппаДиспетчеров);
		Попытка
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(ГруппаДиспетчеров.ИдентификаторОбсуждения); 
	Попытка
		ОбсуждениеСуществует = СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения);
	Исключение
		СправочникОбъект = ГруппаДиспетчеров.ПолучитьОбъект();
		СправочникОбъект.ИдентификаторОбсуждения = Справочники.уатГруппыДиспетчеров.СоздатьСлужебноеОбсуждение(ГруппаДиспетчеров);
		Попытка
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;
		ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(СправочникОбъект.ИдентификаторОбсуждения);
	КонецПопытки; 
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения);
	Если ЗначениеЗаполнено(Автор) Тогда
		ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(Автор.ИдентификаторПользователяИБ);
		Сообщение.Автор = ИдентификаторПользователя;
	КонецЕсли;
	Сообщение.Текст = СодержаниеСообщения;
	
	Для Каждого ТекДиспетчер Из ГруппаДиспетчеров.Диспетчеры Цикл
		Диспетчер = ТекДиспетчер.Диспетчер;
		Если НЕ ЗначениеЗаполнено(Диспетчер) Тогда
			Продолжить;
		КонецЕсли; 
		Попытка
			ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(Диспетчер.ИдентификаторПользователяИБ);
			Сообщение.Получатели.Добавить(ИдентификаторПользователя); 
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла; 
	Сообщение.Записать();
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
